{"keras_version": "2.2.2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 32, "kernel_size": [5, 5], "kernel_constraint": null, "name": "conv2d_4", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_4", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_7", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 128, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_8", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}